-- MySQL dump 10.9
--
-- Host: localhost    Database: coditop
-- ------------------------------------------------------
-- Server version	4.1.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `tblMember`
--

DROP TABLE IF EXISTS `tblMember`;
CREATE TABLE `tblMember` (
  `mem_id` varchar(20) NOT NULL default '',
  `mem_pwd` varchar(50) NOT NULL default '',
  `mem_kind` enum('U','S','A') NOT NULL default 'U',
  `mem_name` varchar(20) NOT NULL default '',
  `mem_jumin` varchar(13) NOT NULL default '',
  `mem_email` varchar(50) NOT NULL default '',
  `mem_mobile` varchar(13) NOT NULL default '',
  `zipcode` varchar(7) default NULL,
  `mem_addr1` varchar(100) default NULL,
  `mem_addr2` varchar(100) default NULL,
  `mem_recom_id` varchar(20) default NULL,
  `mem_mailing` enum('Y','N') NOT NULL default 'Y',
  `mem_status` enum('Y','N','D') NOT NULL default 'Y',
  `mem_grade` tinyint(3) unsigned NOT NULL default '10',
  `mem_cash` int(11) NOT NULL default '0',
  `mem_score` int(10) unsigned NOT NULL default '0',
  `mem_reg_dt` datetime NOT NULL default '0000-00-00 00:00:00',
  `last_reg_dt` datetime NOT NULL default '0000-00-00 00:00:00',
  PRIMARY KEY  (`mem_id`),
  KEY `mem_kind` (`mem_kind`),
  KEY `mem_email` (`mem_email`),
  KEY `mem_mailing` (`mem_mailing`),
  KEY `mem_status` (`mem_status`)
) ENGINE=MyISAM DEFAULT CHARSET=euckr;

--
-- Dumping data for table `tblMember`
--


/*!40000 ALTER TABLE `tblMember` DISABLE KEYS */;
LOCK TABLES `tblMember` WRITE;
INSERT INTO `tblMember` VALUES ('admin','admin1234','A','관리자','1111111111111','center@superboard.com','0112223333','111-111','서울시 중구 신당2동','대영빌딩3층','','N','Y',10,0,2,'2008-07-24 23:14:44','2008-07-24 23:14:44'),('coditop','coditop1234','A','관리자','1111111111111','center@superboard.com','01144445555','111-111','서울시 중구 신당2동','대영빌딩3층','','N','Y',10,0,0,'2008-07-24 23:15:08','2008-07-24 23:15:08'),('goodshop','123456','S','황찬','7605241915513','gogisnim@gmail.com','019-612-2632','120-100','서울 서대문구 홍은동','8-169','','Y','Y',10,800,18,'2008-09-24 13:58:35','2008-09-24 13:58:35'),('tt511','123456','S','허행연','5111202063919','gogisnim@hanmail.net','019-612-2632','650-754','경남 통영시 북신동 진우마리나아파트','406호','','Y','',10,9500,0,'2008-09-28 05:16:23','2008-09-28 05:16:23'),('hong','123456','U','홍길동','7012101259840','kill_9@naver.com','011-512-1588','650-020','경남 통영시 북신동','666-46','','Y','Y',6,0,39,'2008-09-30 14:29:04','2008-10-14 14:29:04'),('gaeddong','123456','U','김개똥','8206141089724','awksed5@hotmail.com','010-6498-521','600-040','부산 중구 남포동','219','','Y','Y',10,0,0,'2008-09-30 14:33:37','2008-10-14 14:33:37'),('green','123456','U','강녹색','7902192041987','gogisnim@innu.pe.kr','010-5128-124','745-860','경북 문경시 마성면','개포리 3가','','Y','Y',10,0,0,'2008-09-30 14:35:33','2008-10-07 14:35:33'),('dulry','123456','U','최둘리','8310251850264','gogisnim@hanmail.net','019-654-2812','150-010','서울 영등포구 여의도동','KBS 본관','','Y','Y',10,0,0,'2008-09-30 14:37:22','2008-10-14 14:37:22'),('amugae','123456','U','아무개','7111301596482','kill_9@naver.com','017-285-4018','501-746','광주 동구 학동 전남대학교의과대학','3층 218호','','Y','Y',10,0,0,'2008-09-30 14:39:05','2008-09-30 14:39:05'),('jipark','123456','U','박지성','8109121640875','ji@manchestunited.com','018-321-5409','568-822','전북 무주군 무풍면 지성리','1번도로 길바닥','','Y','Y',8,0,10,'2008-09-30 14:41:25','2008-10-14 14:41:25'),('seungjjang','123456','U','이승엽','7606151496408','sjjang@yahoo.co.kr','011-654-2108','706-031','대구 수성구 수성동1가','90번지','','Y','Y',9,0,5,'2008-09-30 14:43:08','2008-10-14 14:43:08'),('muuu','123456','U','허정무','6101091036481','muuu@naver.com','017-620-4521','121-270','서울 마포구 상암동','월드컵경기장 3층 꼭대기','','Y','Y',9,0,0,'2008-09-30 14:44:45','2008-10-14 14:44:45'),('beckham','123456','U','이베컴','7310171096548','becks@naver.com','018-745-3246','121-270','서울 마포구 상암동','12-1','','Y','Y',6,0,32,'2008-09-30 14:46:28','2008-10-14 14:46:28'),('gaechuk','123456','U','조중연','4604151350147','dog@kfc.or.kr','011-216-4501','121-270','서울 마포구 상암동','월드컵경기장 무재배 옆방','','Y','Y',10,0,0,'2008-09-30 14:48:16','2008-09-30 14:48:16'),('runny','123456','U','김루니','8612311048796','runny@manchsterunited.com','010-6120-451','217-100','강원 속초시 대포동','1번가 횟집','','Y','Y',9,0,5,'2008-09-30 14:50:02','2008-10-14 14:50:02'),('iruri','123456','S','변재오','7005101602548','iruri@hanmail.net','011-216-6548','415-728','경기 김포시 사우동 김포시청','12-6','','Y','Y',10,8300,13,'2008-09-30 14:56:40','2008-09-30 14:56:40'),('suya','123456','S','양상수','7601242059462','suya@hanmail.net','010-6125-654','138-200','서울 송파구 문정동','12-65','','Y','Y',10,9300,6,'2008-09-30 15:06:17','2008-09-30 15:06:17'),('simsim','123456','S','심심타파','7008151341265','simsim@hanmail.net','011-156-5487','471-728','경기 구리시 인창동 구리농수산물시장','65-4','','Y','Y',10,8300,0,'2008-09-30 15:10:42','2008-09-30 15:10:42'),('ranjjang','123456','S','란짱','7210212615409','ranjjang@hanmail.net','011-625-5469','138-221','서울 송파구 잠실1동','312','','Y','Y',10,8500,0,'2008-09-30 15:19:34','2008-09-30 15:19:34'),('anna','123456','S','조미영','7501252145698','anna@hanmail.net','010-2156-698','423-881','경기 광명시 광명6동 683∼686','12-8','','Y','Y',10,53900,0,'2008-09-30 15:23:17','2008-09-30 15:23:17'),('youngmasan','123456','S','이준상','7511021748952','young@hanmail.net','011-214-6598','131-701','서울 중랑구 신내2동 중랑구청','12','','Y','Y',10,9300,8,'2008-09-30 15:26:14','2008-09-30 15:26:14'),('arica','123456','S','아리까','7506122065419','arica@hanmail.net','010-2165-656','442-785','경기 수원시 팔달구 매산로3가 수원세무서','2122','','Y','Y',10,9000,5,'2008-09-30 15:29:44','2008-09-30 15:29:44'),('jjari','123456','S','김선옥','7310212314567','jjari@hanmail.net','010-3216-654','130-776','서울 동대문구 청량리1동 현대아파트','122','','Y','Y',10,8700,16,'2008-09-30 15:33:06','2008-09-30 15:33:06'),('mandul','123456','S','이진수','7304201269872','mandul@hanmail.net','010-659-8321','156-051','서울 동작구 노량진1동','12-1','','Y','',10,8100,6,'2008-09-30 15:35:42','2008-09-30 15:35:42'),('mlbpark','123456','S','파크','7012121265457','admin@mlbpark.com','011-659-6598','110-290','서울 종로구 인사동','삼익빌딩 12층','','Y','Y',10,9100,8,'2008-09-30 15:45:29','2008-09-30 15:45:29'),('sangmi','123456','U','남상미','8410262041564','sangmi','011-216-3265','133-121','서울 성동구 성수2가1동','12','','Y','Y',7,0,29,'2008-09-30 15:46:55','2008-10-14 15:46:55'),('subin','123456','U','조수빈','8112012036594','subin@kbs.co.kr','010-6521-9859','150-600','서울 영등포구 여의도우체국사서함 1∼99','kbs 한국방송공사 아나운서실','','Y','Y',6,0,40,'2008-09-30 15:48:25','2009-02-18 20:03:39'),('kimmm','123456','U','김명민','7103251204587','kimmm@imbc.com','010-6539-458','150-871','서울 영등포구 여의도동 14','mbc 문화방송','','Y','Y',9,0,7,'2008-09-30 15:50:40','2008-10-14 15:50:40'),('kangsan','ruaths','U','박준형','7502211113819','kangsane@empal.com','016-564-2123','151-010','서울 관악구 신림동','ㅇㅇㅇ','','Y','Y',10,0,0,'2009-02-02 16:35:00','2009-02-16 16:35:00'),('nuna5004','123456','S','냥이','1111112111111','gogisnim@gmail.com','016-387-1035','140-201','서울 용산구 이태원1동','12','gogisnim','Y','Y',1,8300,8,'2009-01-19 19:05:03','2009-01-19 19:05:03'),('kskyda','dnfltmzk','U','강하늘','8502271047010','kskyda@naver.com','011-9128-816','','','','','N','Y',10,0,0,'2008-12-29 16:01:27','2008-12-29 16:01:27');
UNLOCK TABLES;
/*!40000 ALTER TABLE `tblMember` ENABLE KEYS */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

